In [5]:
import pandas as pd
iphone_df = pd.read_csv('iphone.csv', index_col=0)

In [6]:
iphone_df.loc['iPhone 8', '메모리']

'2GB'

In [7]:
iphone_df.loc['iPhone X', :]

출시일        2017-11-03
디스플레이             5.8
메모리               3GB
출시 버전        iOS 11.1
Face ID           Yes
Name: iPhone X, dtype: object

In [8]:
iphone_df.loc['iPhone X']

출시일        2017-11-03
디스플레이             5.8
메모리               3GB
출시 버전        iOS 11.1
Face ID           Yes
Name: iPhone X, dtype: object

In [9]:
type(iphone_df.loc['iPhone X'])

pandas.core.series.Series

In [10]:
iphone_df.loc[:, '출시일']

iPhone 7         2016-09-16
iPhone 7 Plus    2016-09-16
iPhone 8         2017-09-22
iPhone 8 Plus    2017-09-22
iPhone X         2017-11-03
iPhone XS        2018-09-21
iPhone XS Max    2018-09-21
Name: 출시일, dtype: object

In [11]:
iphone_df['출시일']

iPhone 7         2016-09-16
iPhone 7 Plus    2016-09-16
iPhone 8         2017-09-22
iPhone 8 Plus    2017-09-22
iPhone X         2017-11-03
iPhone XS        2018-09-21
iPhone XS Max    2018-09-21
Name: 출시일, dtype: object

In [12]:
import pandas as pd

df = pd.read_csv('broadcast.csv', index_col=0)
df.loc[2016, 'KBS']

np.float64(27.583)

In [13]:
df.loc[:, 'JTBC']

2011    7.380
2012    7.878
2013    7.810
2014    7.490
2015    7.267
2016    7.727
2017    9.453
Name: JTBC, dtype: float64

In [17]:
df.loc[:, ['SBS', 'JTBC']]

         SBS   JTBC
2011  11.173  7.380
2012  11.408  7.878
2013   9.673  7.810
2014   9.108  7.490
2015   9.099  7.267
2016   8.669  7.727
2017   8.661  9.453

In [45]:
import pandas as pd

samsong_df = pd.read_csv('data/samsong.csv')
hyundee_df = pd.read_csv('data/hyundee.csv')

samsong = samsong_df['문화생활비']
hyundee = hyundee_df['문화생활비']
day = ['MON', 'TUE', 'WED', 'THU', 'FRI', 'SAT', 'SUN']

final = {"day": day, "samsong": samsong, "hyundee": hyundee}
result = pd.DataFrame(final)
result

   day  samsong  hyundee
0  MON     4308     5339
1  TUE     7644     3524
2  WED     5674     5364
3  THU     8621     9942
4  FRI    23052    33511
5  SAT    15330    19397
6  SUN    19030    19925

In [47]:
import pandas as pd

df = pd.read_csv('data/broadcast.csv', index_col=0)
df.loc[2012:, 'KBS':'SBS']

         KBS     MBC     SBS
2012  36.163  16.022  11.408
2013  31.989  16.778   9.673
2014  31.210  15.663   9.108
2015  27.777  16.573   9.099
2016  27.583  14.982   8.669
2017  26.890  12.465   8.661

In [49]:
iphone_df.loc[[True, False, True, True, False, True, False]]

                      출시일  디스플레이  메모리     출시 버전 Face ID
iPhone 7       2016-09-16    4.7  2GB  iOS 10.0      No
iPhone 8       2017-09-22    4.7  2GB  iOS 11.0      No
iPhone 8 Plus  2017-09-22    5.5  3GB  iOS 11.0      No
iPhone XS      2018-09-21    5.8  4GB  iOS 12.0     Yes

In [53]:
iphone_df.loc[:, [True, False, True, False, False]]

                      출시일  메모리
iPhone 7       2016-09-16  2GB
iPhone 7 Plus  2016-09-16  3GB
iPhone 8       2017-09-22  2GB
iPhone 8 Plus  2017-09-22  3GB
iPhone X       2017-11-03  3GB
iPhone XS      2018-09-21  4GB
iPhone XS Max  2018-09-21  4GB

In [54]:
iphone_df['Face ID'] == 'Yes'

iPhone 7         False
iPhone 7 Plus    False
iPhone 8         False
iPhone 8 Plus    False
iPhone X          True
iPhone XS         True
iPhone XS Max     True
Name: Face ID, dtype: bool

In [58]:
import pandas as pd

df = pd.read_csv('data/broadcast.csv', index_col=0)
condition = df['KBS'] > 30
df.loc[condition, 'KBS']

2011    35.951
2012    36.163
2013    31.989
2014    31.210
Name: KBS, dtype: float64

In [60]:
import pandas as pd

df = pd.read_csv('data/broadcast.csv', index_col=0)
condition = df['SBS'] < df['TV CHOSUN']
df.loc[condition, ['SBS', 'TV CHOSUN']]

         KBS     MBC    SBS  TV CHOSUN   JTBC  Channel A    MBN
2014  31.210  15.663  9.108      9.440  7.490      5.776  4.572
2015  27.777  16.573  9.099      9.940  7.267      6.678  5.520
2016  27.583  14.982  8.669      9.829  7.727      6.624  5.477
2017  26.890  12.465  8.661      8.886  9.453      6.056  5.215